run/MTP_TC24/0.org/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 137.1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 137.1;
    }
    outlet
    {
        type            zeroGradient;
    }
    middlePlane
    {
        type            symmetryPlane;   
    }        
    solidContact
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr            T;
        kappa           fluidThermo;
        kappaName       none;
        value           uniform 300;
    }

}


// ************************************************************************* //
