run/MTP_TC24/0.org/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        massFlowRate    0.010435;
        rhoInlet        397.6;
        value           uniform (16 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    middlePlane
    {
        type            symmetryPlane;
    }
    solidContact
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }    
}


// ************************************************************************* //
