run/MTP_TC24/0.org/solid/kappa
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 345;

boundaryField
{
    adiabatic
    {
        type            fixedValue;
        value           uniform 345;
    }

    fluidContact
    {
        type            fixedValue;
        value           uniform 345;
    }

    middle
    {
        type            symmetryPlane;
    }

    hot
    {
        type            fixedValue;
        value           uniform 345;
    }

}

// ************************************************************************* //
