run/MTP_TC24/constant/fluid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (17      62.5       30)
    (17      63     30)
    (17      63     33)
    (17      62.5       33)
    (309    62.5       30)  
    (309    63     30)
    (309    63     33)
    (309    62.5       33)  
);

edges
(
);

blocks
(
    hex (0 4 5 1 3 7 6 2) (350 10 30) 
    simpleGrading (
        (
            (5  10 10)
            (90 80 1 )
            (5  10 0.1)
        ) 
        1 
        (
            (50 50 3.5)
            (50 50 0.2857)
        ) 
    )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    
    middlePlane
    {
        type symmetryPlane;
        faces
        (
            (0 3 7 4)
        );
    }
    solidContact
    {
        type mappedWall;
        sampleRegion solid;
        samplePatch fluidContact;
        sampleMode nearestPatchFaceAMI;
	offsetMode uniform;
	offset (0 0 0);	
        faces
        (
            (0 4 5 1)
            (1 2 6 5)
            (3 7 6 2)	    
        );
    }

);

mergePatchPairs
(
);

