run/MTP_TC24/constant/solid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (17      62.5       29)     // 0
    (17      63     29)
    (17      64     29)
    (17      62.5       30)
    (17      63     30)
    (17      64     30)
    (17      63     33)
    (17      64     33)
    
    (309    62.5       29)     // 8
    (309    63     29)
    (309    64     29)
    (309    62.5       30)
    (309    63     30)
    (309    64     30)
    (309    63     33)
    (309    64     33)
    
    (17      62.5       33)  // 16
    (17      62.5       38)
    (17      63     38)
    (17      64     38)
    
    (309    62.5       33)  // 20
    (309    62.5       38)
    (309    63     38)
    (309    64     38)    

    (17      62.5       24.163)  // 24
    (17      67       24.163)
    (17      71.5     24.163)

    (309      62.5       24.163)  // 27
    (309      67       24.163)
    (309      71.5     24.163)    
);


blocks
(
    hex (0 8 9 1 3 11 12 4) (350 8 4) simpleGrading (((5 10 10)(90 80 1)(5 10 0.1)) 1 1) // bottom center 
    hex (1 9 10 2 4 12 13 5) (350 12 4) simpleGrading (((5 10 10)(90 80 1)(5 10 0.1)) 1 1) // bottom right
    hex (4 12 13 5 6 14 15 7) (350 12 16) simpleGrading (((5 10 10)(90 80 1)(5 10 0.1)) 1 1) // center right
    hex (6 14 15 7 18 22 23 19) (350 12 12) simpleGrading (((5 10 10)(90 80 1)(5 10 0.1)) 1 1) // top right 
    hex (16 20 14 6 17 21 22 18) (350 8 12) simpleGrading (((5 10 10)(90 80 1)(5 10 0.1)) 1 1) // top center
    hex (24 27 28 25 0 8 9 1) (350 8 32) simpleGrading (((5 10 10)(90 80 1)(5 10 0.1)) 1 1) // heater center 
    hex (25 28 29 26 1 9 10 2) (350 12 32) simpleGrading (((5 10 10)(90 80 1)(5 10 0.1)) 1 1) // heater right
);

edges
(
arc 1 25 (17 64.3 26)
arc 9 28 (309 64.3 26)

spline 2 26 (
(	17	64	29	)
(	17	64.00211543	28.91875891	)
(	17	64.00845247	28.8376059	)
(	17	64.01898387	28.75662574	)
(	17	64.03366559	28.6758994	)
(	17	64.05243794	28.595504	)
(	17	64.07522687	28.51551284	)
(	17	64.10194511	28.4359953	)
(	17	64.13249343	28.35701684	)
(	17	64.16676188	28.27863894	)
(	17	64.20463092	28.20091905	)
(	17	64.24597271	28.12391059	)
(	17	64.2906523	28.04766284	)
(	17	64.33852884	27.97222098	)
(	17	64.38945679	27.89762596	)
(	17	64.44328715	27.82391454	)
(	17	64.49986866	27.75111921	)
(	17	64.55904903	27.67926812	)
(	17	64.62067614	27.60838512	)
(	17	64.68459926	27.53848963	)
(	17	64.75067025	27.46959665	)
(	17	64.81874482	27.40171672	)
(	17	64.88868369	27.33485584	)
(	17	64.96035383	27.26901546	)
(	17	65.03362968	27.20419246	)
(	17	65.10839431	27.14037906	)
(	17	65.18453724	27.07756448	)
(	17	65.26194992	27.01573803	)
(	17	65.34052952	26.95488796	)
(	17	65.4201793	26.89500131	)
(	17	65.50080844	26.83606397	)
(	17	65.58233181	26.77806085	)
(	17	65.66466972	26.7209759	)
(	17	65.74774776	26.66479229	)
(	17	65.83149654	26.60949242	)
(	17	65.91585151	26.5550581	)
(	17	66.00075272	26.5014706	)
(	17	66.08614461	26.44871077	)
(	17	66.1719758	26.39675912	)
(	17	66.25819888	26.34559595	)
(	17	66.34477019	26.29520143	)
(	17	66.43164959	26.24555567	)
(	17	66.51880028	26.19663889	)
(	17	66.60618853	26.14843145	)
(	17	66.69378354	26.10091398	)
(	17	66.78155716	26.05406749	)
(	17	66.86948369	26.00787344	)
(	17	66.95753971	25.96231387	)
(	17	67.04570378	25.91737146	)
(	17	67.13395631	25.87302967	)
(	17	67.22227936	25.82927279	)
(	17	67.31065768	25.78608534	)
(	17	67.39907835	25.74345178	)
(	17	67.48752929	25.70135701	)
(	17	67.57599919	25.65978636	)
(	17	67.66447749	25.61872556	)
(	17	67.75295436	25.5781608	)
(	17	67.84142066	25.53807865	)
(	17	67.92986794	25.49846611	)
(	17	68.0182884	25.45931054	)
(	17	68.10667487	25.42059971	)
(	17	68.1950208	25.38232177	)
(	17	68.28332023	25.34446522	)
(	17	68.37156776	25.30701895	)
(	17	68.45975852	25.26997218	)
(	17	68.54788818	25.23331449	)
(	17	68.63595292	25.19703578	)
(	17	68.72394935	25.16112628	)
(	17	68.81187457	25.12557657	)
(	17	68.89972611	25.0903775	)
(	17	68.98750189	25.05552026	)
(	17	69.07520022	25.02099631	)
(	17	69.16281977	24.9867974	)
(	17	69.25035956	24.95291559	)
(	17	69.33781892	24.91934316	)
(	17	69.42519747	24.88607269	)
(	17	69.51249511	24.853097	)
(	17	69.59971198	24.82040917	)
(	17	69.68684845	24.78800249	)
(	17	69.7739051	24.75587051	)
(	17	69.86088269	24.72400699	)
(	17	69.94778211	24.69240589	)
(	17	70.03460444	24.66106139	)
(	17	70.12135082	24.62996786	)
(	17	70.20802251	24.59911986	)
(	17	70.29462083	24.56851214	)
(	17	70.38114715	24.53813961	)
(	17	70.46760284	24.50799733	)
(	17	70.55398931	24.47808055	)
(	17	70.64030792	24.44838465	)
(	17	70.72655997	24.41890513	)
(	17	70.81274674	24.38963765	)
(	17	70.89886937	24.36057797	)
(	17	70.98492891	24.33172199	)
(	17	71.07092628	24.30306569	)
(	17	71.15686223	24.27460515	)
(	17	71.24273732	24.24633656	)
(	17	71.32855193	24.21825618	)
(	17	71.41430619	24.19036033	)
(	17	71.5	24.16264534	)
)

spline 10 29 (
(	309	64	29	)
(	309	64.00211543	28.91875891	)
(	309	64.00845247	28.8376059	)
(	309	64.01898387	28.75662574	)
(	309	64.03366559	28.6758994	)
(	309	64.05243794	28.595504	)
(	309	64.07522687	28.51551284	)
(	309	64.10194511	28.4359953	)
(	309	64.13249343	28.35701684	)
(	309	64.16676188	28.27863894	)
(	309	64.20463092	28.20091905	)
(	309	64.24597271	28.12391059	)
(	309	64.2906523	28.04766284	)
(	309	64.33852884	27.97222098	)
(	309	64.38945679	27.89762596	)
(	309	64.44328715	27.82391454	)
(	309	64.49986866	27.75111921	)
(	309	64.55904903	27.67926812	)
(	309	64.62067614	27.60838512	)
(	309	64.68459926	27.53848963	)
(	309	64.75067025	27.46959665	)
(	309	64.81874482	27.40171672	)
(	309	64.88868369	27.33485584	)
(	309	64.96035383	27.26901546	)
(	309	65.03362968	27.20419246	)
(	309	65.10839431	27.14037906	)
(	309	65.18453724	27.07756448	)
(	309	65.26194992	27.01573803	)
(	309	65.34052952	26.95488796	)
(	309	65.4201793	26.89500131	)
(	309	65.50080844	26.83606397	)
(	309	65.58233181	26.77806085	)
(	309	65.66466972	26.7209759	)
(	309	65.74774776	26.66479229	)
(	309	65.83149654	26.60949242	)
(	309	65.91585151	26.5550581	)
(	309	66.00075272	26.5014706	)
(	309	66.08614461	26.44871077	)
(	309	66.1719758	26.39675912	)
(	309	66.25819888	26.34559595	)
(	309	66.34477019	26.29520143	)
(	309	66.43164959	26.24555567	)
(	309	66.51880028	26.19663889	)
(	309	66.60618853	26.14843145	)
(	309	66.69378354	26.10091398	)
(	309	66.78155716	26.05406749	)
(	309	66.86948369	26.00787344	)
(	309	66.95753971	25.96231387	)
(	309	67.04570378	25.91737146	)
(	309	67.13395631	25.87302967	)
(	309	67.22227936	25.82927279	)
(	309	67.31065768	25.78608534	)
(	309	67.39907835	25.74345178	)
(	309	67.48752929	25.70135701	)
(	309	67.57599919	25.65978636	)
(	309	67.66447749	25.61872556	)
(	309	67.75295436	25.5781608	)
(	309	67.84142066	25.53807865	)
(	309	67.92986794	25.49846611	)
(	309	68.0182884	25.45931054	)
(	309	68.10667487	25.42059971	)
(	309	68.1950208	25.38232177	)
(	309	68.28332023	25.34446522	)
(	309	68.37156776	25.30701895	)
(	309	68.45975852	25.26997218	)
(	309	68.54788818	25.23331449	)
(	309	68.63595292	25.19703578	)
(	309	68.72394935	25.16112628	)
(	309	68.81187457	25.12557657	)
(	309	68.89972611	25.0903775	)
(	309	68.98750189	25.05552026	)
(	309	69.07520022	25.02099631	)
(	309	69.16281977	24.9867974	)
(	309	69.25035956	24.95291559	)
(	309	69.33781892	24.91934316	)
(	309	69.42519747	24.88607269	)
(	309	69.51249511	24.853097	)
(	309	69.59971198	24.82040917	)
(	309	69.68684845	24.78800249	)
(	309	69.7739051	24.75587051	)
(	309	69.86088269	24.72400699	)
(	309	69.94778211	24.69240589	)
(	309	70.03460444	24.66106139	)
(	309	70.12135082	24.62996786	)
(	309	70.20802251	24.59911986	)
(	309	70.29462083	24.56851214	)
(	309	70.38114715	24.53813961	)
(	309	70.46760284	24.50799733	)
(	309	70.55398931	24.47808055	)
(	309	70.64030792	24.44838465	)
(	309	70.72655997	24.41890513	)
(	309	70.81274674	24.38963765	)
(	309	70.89886937	24.36057797	)
(	309	70.98492891	24.33172199	)
(	309	71.07092628	24.30306569	)
(	309	71.15686223	24.27460515	)
(	309	71.24273732	24.24633656	)
(	309	71.32855193	24.21825618	)
(	309	71.41430619	24.19036033	)
(	309	71.5	24.16264534	)

)

);

boundary
(
    adiabatic
    {
        type patch;
        faces
        (
            (0 1 4 3)
            (1 2 5 4)
            (4 5 7 6)
            (6 7 19 18)
            (16 6 18 17)
            (24 25 1 0)
            (25 26 2 1)
            
            (8 9 12 11)
            (9 10 13 12)
            (12 13 15 14)
            (14 15 23 22)
            (20 14 22 21)
            (27 28 9 8)
            (28 29 10 9)            
            
            (2 10 13 5)
            (5 13 15 7)
            (7 15 23 19)
            (26 29 10 2)
            
            (17 21 22 18)
            (18 22 23 19)
        );
    }
    fluidContact
    {
        type mappedWall;
        sampleRegion fluid;
        samplePatch solidContact;
        sampleMode nearestPatchFaceAMI;
	    offsetMode uniform;
	    offset (0 0 0);
        faces
        (
            (3 11 12 4)
            (4 12 14 6)
            (16 20 14 6)
        );
    }   
    middle
    {
        type symmetryPlane;
        faces
        (
             (0 3 11 8)
             (16 17 21 20)
             (24 0 8 27)
        );
    }
    
    hot
    {
        type patch;
        faces
        (
            (24 27 28 25)
            (25 28 29 26)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
