run/MTP_TC24/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|p_rgh)"
    {
        solver           GAMG;
        tolerance        1e-8;
        relTol           1e-3;
        maxIter          1000;
        smoother         DICGaussSeidel;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }

    "(U|h|nuTilda)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
    "(k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother  	GaussSeidel;
	nSweeps		2;
        tolerance       1e-8;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    rhoMin          rhoMin [ 1 -3 0 0 0 ] 10;
    rhoMax          rhoMax [ 1 -3 0 0 0 ] 500;
    pMin          pMin [ 1 -1 -2 0 0 ] 50e5;
    pMax          pMax [ 1 -1 -2 0 0 ] 119e5;    
    residualControl
    {
        p               1e-6;
        U               1e-6;
        h               1e-6;

        // possibly check turbulence fields
        "(k|epsilon|omega|nuTilda)" 1e-6;
    }
}

relaxationFactors
{
    fields
    {
        p               0.4;
        rho             0.05;
    }
    equations
    {
        U               0.6;
        "(k|epsilon|omega|nuTilda)"   0.5;
        h               0.5;
    }
}

// ************************************************************************* //
